espressif/esp-idf/components/soc/esp32c3/include/soc/rtc_cntl_struct.h
/*
 * SPDX-FileCopyrightText: 2020-2022 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_RTC_CNTL_STRUCT_H_
#define _SOC_RTC_CNTL_STRUCT_H_
#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct rtc_cntl_dev_s {
    union {
        struct {
            uint32_t sw_stall_appcpu_c0:  2;               /*{reg_sw_stall_appcpu_c1[5:0]   reg_sw_stall_appcpu_c0[1:0]} == 0x86 will stall APP CPU*/
            uint32_t sw_stall_procpu_c0:  2;               /*{reg_sw_stall_procpu_c1[5:0]   reg_sw_stall_procpu_c0[1:0]} == 0x86 will stall PRO CPU*/
            uint32_t sw_appcpu_rst:       1;               /*APP CPU SW reset*/
            uint32_t sw_procpu_rst:       1;               /*PRO CPU SW reset*/
            uint32_t bb_i2c_force_pd:     1;               /*BB_I2C force power down*/
            uint32_t bb_i2c_force_pu:     1;               /*BB_I2C force power up*/
            uint32_t bbpll_i2c_force_pd:  1;               /*BB_PLL _I2C force power down*/
            uint32_t bbpll_i2c_force_pu:  1;               /*BB_PLL_I2C force power up*/
            uint32_t bbpll_force_pd:      1;               /*BB_PLL force power down*/
            uint32_t bbpll_force_pu:      1;               /*BB_PLL force power up*/
            uint32_t xtl_force_pd:        1;               /*crystall force power down*/
            uint32_t xtl_force_pu:        1;               /*crystall force power up*/
            uint32_t xtl_en_wait:         4;               /*wait bias_sleep and current source wakeup*/
            uint32_t reserved18:          2;
            uint32_t ctr_sel:             3;
            uint32_t xtl_force_iso:       1;
            uint32_t pll_force_iso:       1;
            uint32_t analog_force_iso:    1;
            uint32_t xtl_force_noiso:     1;
            uint32_t pll_force_noiso:     1;
            uint32_t analog_force_noiso:  1;
            uint32_t dg_wrap_force_rst:   1;               /*digital wrap force reset in deep sleep*/
            uint32_t dg_wrap_force_norst: 1;               /*digital core force no reset in deep sleep*/
            uint32_t sw_sys_rst:          1;               /*SW system reset*/
        };
        uint32_t val;
    } options0;
    uint32_t slp_timer0;                               /**/
    union {
        struct {
            uint32_t slp_val_hi:             16;           /*RTC sleep timer high 16 bits*/
            uint32_t main_timer_alarm_en:     1;           /*timer alarm enable bit*/
            uint32_t reserved17:             15;
        };
        uint32_t val;
    } slp_timer1;
    union {
        struct {
            uint32_t reserved0:      27;
            uint32_t timer_sys_stall: 1;                   /*Enable to record system stall time*/
            uint32_t timer_xtl_off:   1;                   /*Enable to record 40M XTAL OFF time*/
            uint32_t timer_sys_rst:   1;                   /*enable to record system reset time*/
            uint32_t reserved30:      1;
            uint32_t update:          1;                   /*Set 1: to update register with RTC timer*/
        };
        uint32_t val;
    } time_update;
    uint32_t time_low0;                                /*RTC timer low 32 bits*/
    union {
        struct {
            uint32_t rtc_timer_value0_high:16;             /*RTC timer high 16 bits*/
            uint32_t reserved16:           16;
        };
        uint32_t val;
    } time_high0;
    union {
        struct {
            uint32_t rtc_sw_cpu_int:           1;          /*rtc software interrupt to main cpu*/
            uint32_t rtc_slp_reject_cause_clr: 1;          /*clear rtc sleep reject cause*/
            uint32_t reserved2:               20;
            uint32_t apb2rtc_bridge_sel:       1;          /*1: APB to RTC using bridge*/
            uint32_t reserved23:               5;
            uint32_t sdio_active_ind:          1;          /*SDIO active indication*/
            uint32_t slp_wakeup:               1;          /*leep wakeup bit*/
            uint32_t slp_reject:               1;          /*leep reject bit*/
            uint32_t sleep_en:                 1;          /*sleep enable bit*/
        };
        uint32_t val;
    } state0;
    union {
        struct {
            uint32_t cpu_stall_en:   1;                    /*CPU stall enable bit*/
            uint32_t cpu_stall_wait: 5;                    /*CPU stall wait cycles in fast_clk_rtc*/
            uint32_t ck8m_wait:      8;                    /*CK8M wait cycles in slow_clk_rtc*/
            uint32_t xtl_buf_wait:  10;                    /*XTAL wait cycles in slow_clk_rtc*/
            uint32_t pll_buf_wait:   8;                    /*PLL wait cycles in slow_clk_rtc*/
        };
        uint32_t val;
    } timer1;
    union {
        struct {
            uint32_t reserved0:        24;
            uint32_t min_time_ck8m_off: 8;                 /*minimal cycles in slow_clk_rtc for CK8M in power down state*/
        };
        uint32_t val;
    } timer2;
    union {
        struct {
            uint32_t wifi_wait_timer:    9;
            uint32_t wifi_powerup_timer: 7;
            uint32_t bt_wait_timer:      9;
            uint32_t bt_powerup_timer:   7;
        };
        uint32_t val;
    } timer3;
    union {
        struct {
            uint32_t cpu_top_wait_timer:    9;
            uint32_t cpu_top_powerup_timer: 7;
            uint32_t dg_wrap_wait_timer:    9;
            uint32_t dg_wrap_powerup_timer: 7;
        };
        uint32_t val;
    } timer4;
    union {
        struct {
            uint32_t reserved0:   8;
            uint32_t min_slp_val: 8;                       /*minimal sleep cycles in slow_clk_rtc*/
            uint32_t reserved16: 16;
        };
        uint32_t val;
    } timer5;
    union {
        struct {
            uint32_t reserved0:            16;
            uint32_t dg_peri_wait_timer:    9;
            uint32_t dg_peri_powerup_timer: 7;
        };
        uint32_t val;
    } timer6;
    union {
        struct {
            uint32_t reserved0:             18;
            uint32_t i2c_reset_por_force_pd: 1;
            uint32_t i2c_reset_por_force_pu: 1;
            uint32_t glitch_rst_en:          1;
            uint32_t reserved21:             1;            /*PLLA force power down*/
            uint32_t sar_i2c_pu:             1;            /*PLLA force power up*/
            uint32_t plla_force_pd:          1;            /*PLLA force power down*/
            uint32_t plla_force_pu:          1;            /*PLLA force power up*/
            uint32_t bbpll_cal_slp_start:    1;            /*start BBPLL calibration during sleep*/
            uint32_t pvtmon_pu:              1;            /*1: PVTMON power up*/
            uint32_t txrf_i2c_pu:            1;            /*1: TXRF_I2C power up*/
            uint32_t rfrx_pbus_pu:           1;            /*1: RFRX_PBUS power up*/
            uint32_t reserved29:             1;
            uint32_t ckgen_i2c_pu:           1;            /*1: CKGEN_I2C power up*/
            uint32_t pll_i2c_pu:             1;
        };
        uint32_t val;
    } ana_conf;
    union {
        struct {
            uint32_t reset_cause_procpu:         6;        /*reset cause of PRO CPU*/
            uint32_t reset_cause_appcpu:         6;        /*reset cause of APP CPU*/
            uint32_t stat_vector_sel_appcpu:     1;        /*APP CPU state vector sel*/
            uint32_t stat_vector_sel_procpu:     1;        /*PRO CPU state vector sel*/
            uint32_t all_reset_flag_procpu:      1;        /*PRO CPU reset_flag*/
            uint32_t all_reset_flag_appcpu:      1;        /*APP CPU reset flag*/
            uint32_t all_reset_flag_clr_procpu:  1;        /*clear PRO CPU reset_flag*/
            uint32_t all_reset_flag_clr_appcpu:  1;        /*clear APP CPU reset flag*/
            uint32_t ocd_halt_on_reset_appcpu:   1;        /*APPCPU OcdHaltOnReset*/
            uint32_t ocd_halt_on_reset_procpu:   1;        /*PROCPU OcdHaltOnReset*/
            uint32_t jtag_reset_flag_procpu:     1;
            uint32_t jtag_reset_flag_appcpu:     1;
            uint32_t jtag_reset_flag_clr_procpu: 1;
            uint32_t jtag_reset_flag_clr_appcpu: 1;
            uint32_t rtc_dreset_mask_appcpu:     1;
            uint32_t rtc_dreset_mask_procpu:     1;
            uint32_t reserved26:                 6;
        };
        uint32_t val;
    } reset_state;
    union {
        struct {
            uint32_t reserved0:     15;
            uint32_t rtc_wakeup_ena:17;                    /*wakeup enable bitmap*/
        };
        uint32_t val;
    } wakeup_state;
    union {
        struct {
            uint32_t slp_wakeup:               1;          /*enable sleep wakeup interrupt*/
            uint32_t slp_reject:               1;          /*enable sleep reject interrupt*/
            uint32_t reserved2:                1;          /*enable SDIO idle interrupt*/
            uint32_t rtc_wdt:                  1;          /*enable RTC WDT interrupt*/
            uint32_t reserved4:                5;
            uint32_t rtc_brown_out:            1;          /*enable brown out interrupt*/
            uint32_t rtc_main_timer:           1;          /*enable RTC main timer interrupt*/
            uint32_t reserved11:               4;          /*enable saradc2 interrupt*/
            uint32_t rtc_swd:                  1;          /*enable super watch dog interrupt*/
            uint32_t rtc_xtal32k_dead:         1;          /*enable xtal32k_dead  interrupt*/
            uint32_t reserved17:               2;          /*enable touch timeout interrupt*/
            uint32_t rtc_glitch_det:           1;          /*enbale gitch det interrupt*/
            uint32_t rtc_bbpll_cal:            1;
            uint32_t reserved21:              11;
        };
        uint32_t val;
    } int_ena;
    union {
        struct {
            uint32_t slp_wakeup:               1;          /*sleep wakeup interrupt raw*/
            uint32_t slp_reject:               1;          /*sleep reject interrupt raw*/
            uint32_t reserved2:                1;          /*SDIO idle interrupt raw*/
            uint32_t rtc_wdt:                  1;          /*RTC WDT interrupt raw*/
            uint32_t reserved4:                5;          /*touch inactive interrupt raw*/
            uint32_t rtc_brown_out:            1;          /*brown out interrupt raw*/
            uint32_t rtc_main_timer:           1;          /*RTC main timer interrupt raw*/
            uint32_t reserved11:               4;          /*saradc2 interrupt raw*/
            uint32_t rtc_swd:                  1;          /*super watch dog interrupt raw*/
            uint32_t rtc_xtal32k_dead:         1;          /*xtal32k dead detection interrupt raw*/
            uint32_t reserved17:               2;          /*touch timeout interrupt raw*/
            uint32_t rtc_glitch_det:           1;          /*glitch_det_interrupt_raw*/
            uint32_t rtc_bbpll_cal:            1;
            uint32_t reserved21:              11;
        };
        uint32_t val;
    } int_raw;
    union {
        struct {
            uint32_t slp_wakeup:              1;           /*sleep wakeup interrupt state*/
            uint32_t slp_reject:              1;           /*sleep reject interrupt state*/
            uint32_t reserved2:               1;
            uint32_t rtc_wdt:                 1;           /*RTC WDT interrupt state*/
            uint32_t reserved4:               5;
            uint32_t rtc_brown_out:           1;           /*brown out interrupt state*/
            uint32_t rtc_main_timer:          1;           /*RTC main timer interrupt state*/
            uint32_t reserved11:              4;
            uint32_t rtc_swd:                 1;           /*super watch dog interrupt state*/
            uint32_t rtc_xtal32k_dead:        1;           /*xtal32k dead detection interrupt state*/
            uint32_t reserved17:              2;
            uint32_t rtc_glitch_det:          1;           /*glitch_det_interrupt state*/
            uint32_t rtc_bbpll_cal:           1;
            uint32_t reserved21:             11;
        };
        uint32_t val;
    } int_st;
    union {
        struct {
            uint32_t slp_wakeup:               1;          /*Clear sleep wakeup interrupt state*/
            uint32_t slp_reject:               1;          /*Clear sleep reject interrupt state*/
            uint32_t reserved2:                1;
            uint32_t rtc_wdt:                  1;          /*Clear RTC WDT interrupt state*/
            uint32_t reserved4:                5;
            uint32_t rtc_brown_out:            1;          /*Clear brown out interrupt state*/
            uint32_t rtc_main_timer:           1;          /*Clear RTC main timer interrupt state*/
            uint32_t reserved11:               4;
            uint32_t rtc_swd:                  1;          /*Clear super watch dog interrupt state*/
            uint32_t rtc_xtal32k_dead:         1;          /*Clear RTC WDT interrupt state*/
            uint32_t reserved17:               2;
            uint32_t rtc_glitch_det:           1;          /*Clear glitch det interrupt state*/
            uint32_t rtc_bbpll_cal:            1;
            uint32_t reserved21:              11;
        };
        uint32_t val;
    } int_clr;
    uint32_t store[4];                                   /**/
    union {
        struct {
            uint32_t xtal32k_wdt_en:       1;              /*xtal 32k watch dog enable*/
            uint32_t xtal32k_wdt_clk_fo:   1;              /*xtal 32k watch dog clock force on*/
            uint32_t xtal32k_wdt_reset:    1;              /*xtal 32k watch dog sw reset*/
            uint32_t xtal32k_ext_clk_fo:   1;              /*xtal 32k external xtal clock force on*/
            uint32_t xtal32k_auto_backup:  1;              /*xtal 32k switch to back up clock when xtal is dead*/
            uint32_t xtal32k_auto_restart: 1;              /*xtal 32k restart xtal when xtal is dead*/
            uint32_t xtal32k_auto_return:  1;              /*xtal 32k switch back xtal when xtal is restarted*/
            uint32_t xtal32k_xpd_force:    1;              /*Xtal 32k xpd control by sw or fsm*/
            uint32_t enckinit_xtal_32k:    1;              /*apply an internal clock to help xtal 32k to start*/
            uint32_t dbuf_xtal_32k:        1;              /*0: single-end buffer 1: differential buffer*/
            uint32_t dgm_xtal_32k:         3;              /*xtal_32k gm control*/
            uint32_t dres_xtal_32k:        3;              /*DRES_XTAL_32K*/
            uint32_t xpd_xtal_32k:         1;              /*XPD_XTAL_32K*/
            uint32_t dac_xtal_32k:         3;              /*DAC_XTAL_32K*/
            uint32_t rtc_wdt_state:        3;              /*state of 32k_wdt*/
            uint32_t rtc_xtal32k_gpio_sel: 1;              /*XTAL_32K sel. 0: external XTAL_32K*/
            uint32_t reserved24:           6;
            uint32_t ctr_lv:               1;              /*0: power down XTAL at high level*/
            uint32_t ctr_en:               1;
        };
        uint32_t val;
    } ext_xtl_conf;
    union {
        struct {
            uint32_t reserved0:         31;
            uint32_t gpio_wakeup_filter: 1;                /*enable filter for gpio wakeup event*/
        };
        uint32_t val;
    } ext_wakeup_conf;
    union {
        struct {
            uint32_t reserved0:           12;
            uint32_t rtc_sleep_reject_ena:18;              /*sleep reject enable*/
            uint32_t light_slp_reject_en:  1;              /*enable reject for light sleep*/
            uint32_t deep_slp_reject_en:   1;              /*enable reject for deep sleep*/
        };
        uint32_t val;
    } slp_reject_conf;
    union {
        struct {
            uint32_t reserved0:        29;
            uint32_t cpusel_conf:       1;                 /*CPU sel option*/
            uint32_t cpuperiod_sel:     2;
        };
        uint32_t val;
    } cpu_period_conf;
    union {
        struct {
            uint32_t reserved0:                  1;
            uint32_t efuse_clk_force_gating:     1;
            uint32_t efuse_clk_force_nogating:   1;
            uint32_t ck8m_div_sel_vld:           1;        /*used to sync reg_ck8m_div_sel bus. Clear vld before set reg_ck8m_div_sel*/
            uint32_t ck8m_div:                   2;        /*CK8M_D256_OUT divider. 00: div128*/
            uint32_t enb_ck8m:                   1;        /*disable CK8M and CK8M_D256_OUT*/
            uint32_t enb_ck8m_div:               1;        /*1: CK8M_D256_OUT is actually CK8M*/
            uint32_t dig_xtal32k_en:             1;        /*enable CK_XTAL_32K for digital core (no relationship with RTC core)*/
            uint32_t dig_clk8m_d256_en:          1;        /*enable CK8M_D256_OUT for digital core (no relationship with RTC core)*/
            uint32_t dig_clk8m_en:               1;        /*enable CK8M for digital core (no relationship with RTC core)*/
            uint32_t reserved11:                 1;
            uint32_t ck8m_div_sel:               3;        /*divider = reg_ck8m_div_sel + 1*/
            uint32_t xtal_force_nogating:        1;        /*XTAL force no gating during sleep*/
            uint32_t ck8m_force_nogating:        1;        /*CK8M force no gating during sleep*/
            uint32_t ck8m_dfreq:                 8;        /*CK8M_DFREQ*/
            uint32_t ck8m_force_pd:              1;        /*CK8M force power down*/
            uint32_t ck8m_force_pu:              1;        /*CK8M force power up*/
            uint32_t xtal_global_force_gating:   1;
            uint32_t xtal_global_force_nogating: 1;
            uint32_t fast_clk_rtc_sel:           1;        /*fast_clk_rtc sel. 0: XTAL div 2*/
            uint32_t ana_clk_rtc_sel:            2;
        };
        uint32_t val;
    } clk_conf;
    union {
        struct {
            uint32_t reserved0:             22;
            uint32_t rtc_ana_clk_div_vld:    1;            /*used to sync div bus. clear vld before set reg_rtc_ana_clk_div*/
            uint32_t rtc_ana_clk_div:        8;
            uint32_t slow_clk_next_edge:     1;
        };
        uint32_t val;
    } slow_clk_conf;
    union {
        struct {
            uint32_t sdio_timer_target: 8;                 /*timer count to apply reg_sdio_dcap after sdio power on*/
            uint32_t reserved8:         1;
            uint32_t sdio_dthdrv:       2;                 /*Tieh = 1 mode drive ability. Initially set to 0 to limit charge current*/
            uint32_t sdio_dcap:         2;                 /*ability to prevent LDO from overshoot*/
            uint32_t sdio_initi:        2;                 /*add resistor from ldo output to ground. 0: no res*/
            uint32_t sdio_en_initi:     1;                 /*0 to set init[1:0]=0*/
            uint32_t sdio_dcurlim:      3;                 /*tune current limit threshold when tieh = 0. About 800mA/(8+d)*/
            uint32_t sdio_modecurlim:   1;                 /*select current limit mode*/
            uint32_t sdio_encurlim:     1;                 /*enable current limit*/
            uint32_t sdio_pd_en:        1;                 /*power down SDIO_REG in sleep. Only active when reg_sdio_force = 0*/
            uint32_t sdio_force:        1;                 /*1: use SW option to control SDIO_REG*/
            uint32_t sdio_tieh:         1;                 /*SW option for SDIO_TIEH. Only active when reg_sdio_force = 1*/
            uint32_t reg1p8_ready:      1;                 /*read only register for REG1P8_READY*/
            uint32_t drefl_sdio:        2;                 /*SW option for DREFL_SDIO. Only active when reg_sdio_force = 1*/
            uint32_t drefm_sdio:        2;                 /*SW option for DREFM_SDIO. Only active when reg_sdio_force = 1*/
            uint32_t drefh_sdio:        2;                 /*SW option for DREFH_SDIO. Only active when reg_sdio_force = 1*/
            uint32_t xpd_sdio:          1;
        };
        uint32_t val;
    } sdio_conf;
    union {
        struct {
            uint32_t dg_vdd_drv_b_slp:    8;
            uint32_t dg_vdd_drv_b_slp_en: 1;
            uint32_t reserved9:           1;
            uint32_t bias_buf_idle:       1;
            uint32_t bias_buf_wake:       1;
            uint32_t bias_buf_deep_slp:   1;
            uint32_t bias_buf_monitor:    1;
            uint32_t pd_cur_deep_slp:     1;               /*xpd cur when rtc in sleep_state*/
            uint32_t pd_cur_monitor:      1;               /*xpd cur when rtc in monitor state*/
            uint32_t bias_sleep_deep_slp: 1;               /*bias_sleep when rtc in sleep_state*/
            uint32_t bias_sleep_monitor:  1;               /*bias_sleep when rtc in monitor state*/
            uint32_t dbg_atten_deep_slp:  4;               /*DBG_ATTEN when rtc in sleep state*/
            uint32_t dbg_atten_monitor:   4;               /*DBG_ATTEN when rtc in monitor state*/
            uint32_t reserved26:          6;
        };
        uint32_t val;
    } bias_conf;
    union {
        struct {
            uint32_t reserved0:           7;
            uint32_t dig_cal_en:          1;
            uint32_t reserved8:           6;
            uint32_t sck_dcap:            8;               /*SCK_DCAP*/
            uint32_t reserved22:          6;
            uint32_t rtc_dboost_force_pd: 1;               /*RTC_DBOOST force power down*/
            uint32_t rtc_dboost_force_pu: 1;               /*RTC_DBOOST force power up*/
            uint32_t rtculator_force_pd:  1;               /*RTC_REG force power down (for RTC_REG power down means decrease the voltage to 0.8v or lower )*/
            uint32_t rtculator_force_pu:  1;
        };
        uint32_t val;
    } rtc;
    union {
        struct {
            uint32_t reserved0:         21;
            uint32_t rtc_pad_force_hold: 1;                /*rtc pad force hold*/
            uint32_t reserved22:        10;
        };
        uint32_t val;
    } rtc_pwc;
    union {
        struct {
            uint32_t vdd_spi_pwr_drv:       2;
            uint32_t vdd_spi_pwr_force:     1;
            uint32_t lslp_mem_force_pd:     1;             /*memories in digital core force PD in sleep*/
            uint32_t lslp_mem_force_pu:     1;             /*memories in digital core force no PD in sleep*/
            uint32_t reserved5:             6;
            uint32_t bt_force_pd:           1;
            uint32_t bt_force_pu:           1;
            uint32_t dg_peri_force_pd:      1;
            uint32_t dg_peri_force_pu:      1;
            uint32_t fastmem_force_lpd:     1;
            uint32_t fastmem_force_lpu:     1;
            uint32_t wifi_force_pd:         1;             /*wifi force power down*/
            uint32_t wifi_force_pu:         1;             /*wifi force power up*/
            uint32_t dg_wrap_force_pd:      1;             /*digital core force power down*/
            uint32_t dg_wrap_force_pu:      1;             /*digital core force power up*/
            uint32_t cpu_top_force_pd:      1;
            uint32_t cpu_top_force_pu:      1;
            uint32_t reserved23:            4;
            uint32_t bt_pd_en:              1;
            uint32_t dg_peri_pd_en:         1;
            uint32_t cpu_top_pd_en:         1;
            uint32_t wifi_pd_en:            1;             /*enable power down wifi in sleep*/
            uint32_t dg_wrap_pd_en:         1;
        };
        uint32_t val;
    } dig_pwc;
    union {
        struct {
            uint32_t reserved0:           7;
            uint32_t dig_iso_force_off:   1;
            uint32_t dig_iso_force_on:    1;
            uint32_t dg_pad_autohold:     1;               /*read only register to indicate digital pad auto-hold status*/
