espressif/esp-idf/components/soc/esp32c3/include/soc/rtc_cntl_struct.h
            uint32_t clr_dg_pad_autohold: 1;               /*wtite only register to clear digital pad auto-hold*/
            uint32_t dg_pad_autohold_en:  1;               /*digital pad enable auto-hold*/
            uint32_t dg_pad_force_noiso:  1;               /*digital pad force no ISO*/
            uint32_t dg_pad_force_iso:    1;               /*digital pad force ISO*/
            uint32_t dg_pad_force_unhold: 1;               /*digital pad force un-hold*/
            uint32_t dg_pad_force_hold:   1;               /*digital pad force hold*/
            uint32_t reserved16:          6;
            uint32_t bt_force_iso:        1;
            uint32_t bt_force_noiso:      1;
            uint32_t dg_peri_force_iso:   1;
            uint32_t dg_peri_force_noiso: 1;
            uint32_t cpu_top_force_iso:   1;               /*cpu force ISO*/
            uint32_t cpu_top_force_noiso: 1;               /*cpu force no ISO*/
            uint32_t wifi_force_iso:      1;               /*wifi force ISO*/
            uint32_t wifi_force_noiso:    1;               /*wifi force no ISO*/
            uint32_t dg_wrap_force_iso:   1;               /*digital core force ISO*/
            uint32_t dg_wrap_force_noiso: 1;
        };
        uint32_t val;
    } dig_iso;
    union {
        struct {
            uint32_t chip_reset_width:     8;              /*chip reset siginal pulse width*/
            uint32_t chip_reset_en:        1;              /*wdt reset whole chip enable*/
            uint32_t pause_in_slp:         1;              /*pause WDT in sleep*/
            uint32_t appcpu_reset_en:      1;              /*enable WDT reset APP CPU*/
            uint32_t procpu_reset_en:      1;              /*enable WDT reset PRO CPU*/
            uint32_t flashboot_mod_en:     1;              /*enable WDT in flash boot*/
            uint32_t sys_reset_length:     3;              /*system reset counter length*/
            uint32_t cpu_reset_length:     3;              /*CPU reset counter length*/
            uint32_t stg3:                 3;              /*1: interrupt stage en*/
            uint32_t stg2:                 3;              /*1: interrupt stage en*/
            uint32_t stg1:                 3;              /*1: interrupt stage en*/
            uint32_t stg0:                 3;              /*1: interrupt stage en*/
            uint32_t en:                   1;
        };
        uint32_t val;
    } wdt_config0;
    uint32_t wdt_config1;                               /**/
    uint32_t wdt_config2;                               /**/
    uint32_t wdt_config3;                               /**/
    uint32_t wdt_config4;                               /**/
    union {
        struct {
            uint32_t reserved0:   31;
            uint32_t feed:         1;
        };
        uint32_t val;
    } wdt_feed;
    uint32_t wdt_wprotect;                              /**/
    union {
        struct {
            uint32_t swd_reset_flag:   1;                  /*swd reset flag*/
            uint32_t swd_feed_int:     1;                  /*swd interrupt for feeding*/
            uint32_t reserved2:       15;
            uint32_t swd_bypass_rst:   1;
            uint32_t swd_signal_width:10;                  /*adjust signal width send to swd*/
            uint32_t swd_rst_flag_clr: 1;                  /*reset swd reset flag*/
            uint32_t swd_feed:         1;                  /*Sw feed swd*/
            uint32_t swd_disable:      1;                  /*disabel SWD*/
            uint32_t swd_auto_feed_en: 1;                  /*automatically feed swd when int comes*/
        };
        uint32_t val;
    } swd_conf;
    uint32_t swd_wprotect;                             /**/
    union {
        struct {
            uint32_t reserved0:         20;
            uint32_t appcpu_c1:          6;                /*{reg_sw_stall_appcpu_c1[5:0]*/
            uint32_t procpu_c1:          6;
        };
        uint32_t val;
    } sw_cpu_stall;
    uint32_t store4;                                   /**/
    uint32_t store5;                                   /**/
    uint32_t store6;                                   /**/
    uint32_t store7;                                   /**/
    union {
        struct {
            uint32_t xpd_rom0:                   1;        /*rom0 power down*/
            uint32_t reserved1:                  1;
            uint32_t xpd_dig_dcdc:               1;        /*External DCDC power down*/
            uint32_t rtc_peri_iso:               1;        /*rtc peripheral iso*/
            uint32_t xpd_rtc_peri:               1;        /*rtc peripheral power down*/
            uint32_t wifi_iso:                   1;        /*wifi iso*/
            uint32_t xpd_wifi:                   1;        /*wifi wrap power down*/
            uint32_t dig_iso:                    1;        /*digital wrap iso*/
            uint32_t xpd_dig:                    1;        /*digital wrap power down*/
            uint32_t rtc_touch_state_start:      1;        /*touch should start to work*/
            uint32_t rtc_touch_state_switch:     1;        /*touch is about to working. Switch rtc main state*/
            uint32_t rtc_touch_state_slp:        1;        /*touch is in sleep state*/
            uint32_t rtc_touch_state_done:       1;        /*touch is done*/
            uint32_t rtc_cocpu_state_start:      1;        /*ulp/cocpu should start to work*/
            uint32_t rtc_cocpu_state_switch:     1;        /*ulp/cocpu is about to working. Switch rtc main state*/
            uint32_t rtc_cocpu_state_slp:        1;        /*ulp/cocpu is in sleep state*/
            uint32_t rtc_cocpu_state_done:       1;        /*ulp/cocpu is done*/
            uint32_t rtc_main_state_xtal_iso:    1;        /*no use any more*/
            uint32_t rtc_main_state_pll_on:      1;        /*rtc main state machine is in states that pll should be running*/
            uint32_t rtc_rdy_for_wakeup:         1;        /*rtc is ready to receive wake up trigger from wake up source*/
            uint32_t rtc_main_state_wait_end:    1;        /*rtc main state machine has been waited for some cycles*/
            uint32_t rtc_in_wakeup_state:        1;        /*rtc main state machine is in the states of wakeup process*/
            uint32_t rtc_in_low_power_state:     1;        /*rtc main state machine is in the states of low power*/
            uint32_t rtc_main_state_in_wait_8m:  1;        /*rtc main state machine is in wait 8m state*/
            uint32_t rtc_main_state_in_wait_pll: 1;        /*rtc main state machine is in wait pll state*/
            uint32_t rtc_main_state_in_wait_xtl: 1;        /*rtc main state machine is in wait xtal state*/
            uint32_t rtc_main_state_in_slp:      1;        /*rtc main state machine is in sleep state*/
            uint32_t rtc_main_state_in_idle:     1;        /*rtc main state machine is in idle state*/
            uint32_t rtc_main_state:             4;        /*rtc main state machine status*/
        };
        uint32_t val;
    } low_power_st;
    uint32_t diag0;                                    /**/
    union {
        struct {
            uint32_t rtc_gpio_pin0_hold: 1;
            uint32_t rtc_gpio_pin1_hold: 1;
            uint32_t rtc_gpio_pin2_hold: 1;
            uint32_t rtc_gpio_pin3_hold: 1;
            uint32_t rtc_gpio_pin4_hold: 1;
            uint32_t rtc_gpio_pin5_hold: 1;
            uint32_t reserved6:         26;
        };
        uint32_t val;
    } pad_hold;
    uint32_t dig_pad_hold;                                 /**/
    union {
        struct {
            uint32_t reserved0:                 4;
            uint32_t int_wait:                 10;         /*brown out interrupt wait cycles*/
            uint32_t close_flash_ena:           1;         /*enable close flash when brown out happens*/
            uint32_t pd_rf_ena:                 1;         /*enable power down RF when brown out happens*/
            uint32_t rst_wait:                 10;         /*brown out reset wait cycles*/
            uint32_t rst_ena:                   1;         /*enable brown out reset*/
            uint32_t rst_sel:                   1;         /*1:  4-pos reset*/
            uint32_t ana_rst_en:                1;
            uint32_t cnt_clr:                   1;         /*clear brown out counter*/
            uint32_t ena:                       1;         /*enable brown out*/
            uint32_t det:                       1;
        };
        uint32_t val;
    } brown_out;
    uint32_t time_low1;                                /*RTC timer low 32 bits*/
    union {
        struct {
            uint32_t rtc_timer_value1_high:16;             /*RTC timer high 16 bits*/
            uint32_t reserved16:           16;
        };
        uint32_t val;
    } time_high1;
    uint32_t xtal32k_clk_factor;                       /*xtal 32k watch dog backup clock factor*/
    union {
        struct {
            uint32_t xtal32k_return_wait:  4;              /*cycles to wait to return noral xtal 32k*/
            uint32_t xtal32k_restart_wait:16;              /*cycles to wait to repower on xtal 32k*/
            uint32_t xtal32k_wdt_timeout:  8;              /*If no clock detected for this amount of time*/
            uint32_t xtal32k_stable_thres: 4;              /*if restarted xtal32k period is smaller than this*/
        };
        uint32_t val;
    } xtal32k_conf;
    union {
        struct {
            uint32_t reserved0:           18;
            uint32_t io_mux_reset_disable: 1;
            uint32_t reserved19:          13;
        };
        uint32_t val;
    } usb_conf;
    union {
        struct {
            uint32_t reject_cause:18;                      /*sleep reject cause*/
            uint32_t reserved18:  14;
        };
        uint32_t val;
    } slp_reject_cause;
    union {
        struct {
            uint32_t force_download_boot: 1;
            uint32_t reserved1:          31;
        };
        uint32_t val;
    } option1;
    union {
        struct {
            uint32_t wakeup_cause:17;                      /*sleep wakeup cause*/
            uint32_t reserved17:  15;
        };
        uint32_t val;
    } slp_wakeup_cause;
    union {
        struct {
            uint32_t reserved0:              8;
            uint32_t ulp_cp_timer_slp_cycle:24;            /*sleep cycles for ULP-coprocessor timer*/
        };
        uint32_t val;
    } ulp_cp_timer_1;
    union {
        struct {
            uint32_t slp_wakeup_w1ts:               1;     /*enable sleep wakeup interrupt*/
            uint32_t slp_reject_w1ts:               1;     /*enable sleep reject interrupt*/
            uint32_t reserved2:                     1;
            uint32_t rtc_wdt_w1ts:                  1;     /*enable RTC WDT interrupt*/
            uint32_t reserved4:                     5;
            uint32_t w1ts:                          1;     /*enable brown out interrupt*/
            uint32_t rtc_main_timer_w1ts:           1;     /*enable RTC main timer interrupt*/
            uint32_t reserved11:                    4;
            uint32_t rtc_swd_w1ts:                  1;     /*enable super watch dog interrupt*/
            uint32_t rtc_xtal32k_dead_w1ts:         1;     /*enable xtal32k_dead  interrupt*/
            uint32_t reserved17:                    2;
            uint32_t rtc_glitch_det_w1ts:           1;     /*enbale gitch det interrupt*/
            uint32_t rtc_bbpll_cal_w1ts:            1;
            uint32_t reserved21:                   11;
        };
        uint32_t val;
    } int_ena_w1ts;
    union {
        struct {
            uint32_t slp_wakeup_w1tc:               1;     /*enable sleep wakeup interrupt*/
            uint32_t slp_reject_w1tc:               1;     /*enable sleep reject interrupt*/
            uint32_t reserved2:                     1;
            uint32_t rtc_wdt_w1tc:                  1;     /*enable RTC WDT interrupt*/
            uint32_t reserved4:                     5;
            uint32_t w1tc:                          1;     /*enable brown out interrupt*/
            uint32_t rtc_main_timer_w1tc:           1;     /*enable RTC main timer interrupt*/
            uint32_t reserved11:                    4;
            uint32_t rtc_swd_w1tc:                  1;     /*enable super watch dog interrupt*/
            uint32_t rtc_xtal32k_dead_w1tc:         1;     /*enable xtal32k_dead  interrupt*/
            uint32_t reserved17:                    2;
            uint32_t rtc_glitch_det_w1tc:           1;     /*enbale gitch det interrupt*/
            uint32_t rtc_bbpll_cal_w1tc:            1;
            uint32_t reserved21:                   11;
        };
        uint32_t val;
    } int_ena_w1tc;
    union {
        struct {
            uint32_t reserved0:            18;
            uint32_t retention_clk_sel:     1;
            uint32_t retention_done_wait:   3;
            uint32_t retention_clkoff_wait: 4;
            uint32_t retention_en:          1;
            uint32_t retention_wait:        5;             /*wait cycles for rention operation*/
        };
        uint32_t val;
    } retention_ctrl;
    union {
        struct {
            uint32_t rtc_fib_sel: 3;                       /*select use analog fib signal*/
            uint32_t reserved3:  29;
        };
        uint32_t val;
    } fib_sel;
    union {
        struct {
            uint32_t rtc_gpio_wakeup_status:      6;
            uint32_t rtc_gpio_wakeup_status_clr:  1;
            uint32_t rtc_gpio_pin_clk_gate:       1;
            uint32_t rtc_gpio_pin5_int_type:      3;
            uint32_t rtc_gpio_pin4_int_type:      3;
            uint32_t rtc_gpio_pin3_int_type:      3;
            uint32_t rtc_gpio_pin2_int_type:      3;
            uint32_t rtc_gpio_pin1_int_type:      3;
            uint32_t rtc_gpio_pin0_int_type:      3;
            uint32_t rtc_gpio_pin5_wakeup_enable: 1;
            uint32_t rtc_gpio_pin4_wakeup_enable: 1;
            uint32_t rtc_gpio_pin3_wakeup_enable: 1;
            uint32_t rtc_gpio_pin2_wakeup_enable: 1;
            uint32_t rtc_gpio_pin1_wakeup_enable: 1;
            uint32_t rtc_gpio_pin0_wakeup_enable: 1;
        };
        uint32_t val;
    } gpio_wakeup;
    union {
        struct {
            uint32_t reserved0:               1;
            uint32_t rtc_debug_12m_no_gating: 1;
            uint32_t rtc_debug_bit_sel:       5;
            uint32_t rtc_debug_sel0:          5;
            uint32_t rtc_debug_sel1:          5;
            uint32_t rtc_debug_sel2:          5;
            uint32_t rtc_debug_sel3:          5;
            uint32_t rtc_debug_sel4:          5;
        };
        uint32_t val;
    } dbg_sel;
    union {
        struct {
            uint32_t reserved0:             2;
            uint32_t rtc_gpio_pin5_mux_sel: 1;
            uint32_t rtc_gpio_pin4_mux_sel: 1;
            uint32_t rtc_gpio_pin3_mux_sel: 1;
            uint32_t rtc_gpio_pin2_mux_sel: 1;
            uint32_t rtc_gpio_pin1_mux_sel: 1;
            uint32_t rtc_gpio_pin0_mux_sel: 1;
            uint32_t rtc_gpio_pin5_fun_sel: 4;
            uint32_t rtc_gpio_pin4_fun_sel: 4;
            uint32_t rtc_gpio_pin3_fun_sel: 4;
            uint32_t rtc_gpio_pin2_fun_sel: 4;
            uint32_t rtc_gpio_pin1_fun_sel: 4;
            uint32_t rtc_gpio_pin0_fun_sel: 4;
        };
        uint32_t val;
    } dbg_map;
    union {
        struct {
            uint32_t reserved0:     27;
            uint32_t sar2_pwdet_cct: 3;
            uint32_t force_xpd_sar:  2;
        };
        uint32_t val;
    } sensor_ctrl;
    union {
        struct {
            uint32_t reserved0:    27;
            uint32_t sar_debug_sel: 5;
        };
        uint32_t val;
    } dbg_sar_sel;
    union {
        struct {
            uint32_t reserved0:             26;
            uint32_t power_glitch_dsense:    2;
            uint32_t power_glitch_force_pd:  1;
            uint32_t power_glitch_force_pu:  1;
            uint32_t power_glitch_efuse_sel: 1;
            uint32_t power_glitch_en:        1;
        };
        uint32_t val;
    } pg_ctrl;
    uint32_t reserved_128;
    uint32_t reserved_12c;
    uint32_t reserved_130;
    uint32_t reserved_134;
    uint32_t reserved_138;
    uint32_t reserved_13c;
    uint32_t reserved_140;
    uint32_t reserved_144;
    uint32_t reserved_148;
    uint32_t reserved_14c;
    uint32_t reserved_150;
    uint32_t reserved_154;
    uint32_t reserved_158;
    uint32_t reserved_15c;
    uint32_t reserved_160;
    uint32_t reserved_164;
    uint32_t reserved_168;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    uint32_t reserved_190;
    uint32_t reserved_194;
    uint32_t reserved_198;
    uint32_t reserved_19c;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t reserved_1f8;
    union {
        struct {
            uint32_t date:      28;
            uint32_t reserved28: 4;
        };
        uint32_t val;
    } date;
} rtc_cntl_dev_t;
extern rtc_cntl_dev_t RTCCNTL;
#ifdef __cplusplus
}
#endif

#endif  /* _SOC_RTC_CNTL_STRUCT_H_ */
